fonecmid-diplom/src/Documents/ВКМ_ВводОтпуска/ВКМ_ВводОтпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВводОтпуска</name>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ДополнительныеНачисления/ВКМ_ДополнительныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ДополнительныеНачисления</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВводОтпуска/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		ВызватьИсключение "Не заполнен сотрудник";
	КонецЕсли;
	
	Если ДатаНачала = '00010101' Или ДатаОкончания = '00010101' Тогда
		ВызватьИсключение "Не заполнены даты отпуска";
	КонецЕсли;
	
	Если ДатаОкончания < ДатаНачала Тогда
		ВызватьИсключение "Дата окончания отпуска меньше даты начала";
	КонецЕсли;
	
	НачалоПериода12 = НачалоМесяца(ДобавитьМесяц(ДатаНачала, -12));
	КонецПериода12  = КонецМесяца(ДобавитьМесяц(ДатаНачала, -1));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник",     Сотрудник);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода12);
	Запрос.УстановитьПараметр("КонецПериода",  КонецПериода12);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(Н.Результат) КАК СуммаНачислений
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК Н
	|ГДЕ
	|	Н.Сотрудник = &Сотрудник
	|	И Н.ПериодРегистрации >= &НачалоПериода
	|	И Н.ПериодРегистрации <= &КонецПериода
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(Д.Результат)
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК Д
	|ГДЕ
	|	Д.Сотрудник = &Сотрудник
	|	И Д.ПериодРегистрации >= &НачалоПериода
	|	И Д.ПериодРегистрации <= &КонецПериода";
	
	НачисленоЗа12Мес = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.СуммаНачислений <> Null Тогда
			НачисленоЗа12Мес = НачисленоЗа12Мес + Выборка.СуммаНачислений;
		КонецЕсли;
	КонецЦикла;
	
	РабочихДней = РабочихДнейВПериоде(НачалоПериода12, КонецПериода12);
	Если РабочихДней = 0 Тогда
		ВызватьИсключение "Нет рабочих дней в расчётном периоде (12 мес.) для расчёта отпускных";
	КонецЕсли;
	
	КоэффициентНДФЛ = Константы.ВКМ_ПроцентНДФЛ.КоэффициентНДФЛ();
	
	КалДнейОтпуска  = (КонецДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / 86400 + 1;
	СуммаОтпускных  = Окр(НачисленоЗа12Мес / РабочихДней * КалДнейОтпуска, 2);
	СуммаНДФЛ       = Окр(СуммаОтпускных * КоэффициентНДФЛ, 2);
	
	НачалоМес = НачалоМесяца(ДатаНачала);
	
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_ОсновныеНачисления.Очистить();
	
	ДвижОтпуск = Движения.ВКМ_ОсновныеНачисления.Добавить();
	ДвижОтпуск.ПериодРегистрации = НачалоМес;
	ДвижОтпуск.ВидРасчета        = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;
	ДвижОтпуск.Сотрудник         = Сотрудник;
	ДвижОтпуск.Результат         = СуммаОтпускных;
	
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_Удержания.Очистить();
	
	ДвижНДФЛ = Движения.ВКМ_Удержания.Добавить();
	ДвижНДФЛ.ПериодРегистрации = НачалоМес;
	ДвижНДФЛ.ВидРасчета        = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
	ДвижНДФЛ.Сотрудник         = Сотрудник;
	ДвижНДФЛ.Результат         = СуммаНДФЛ;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
	
	ДвижВЗ = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
	ДвижВЗ.ВидДвижения = ВидДвиженияНакопления.Приход;
	ДвижВЗ.Период      = ДатаНачала;
	ДвижВЗ.Сотрудник   = Сотрудник;
	ДвижВЗ.Сумма       = СуммаОтпускных - СуммаНДФЛ;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РабочихДнейВПериоде(ДатаНач, ДатаКон)
	
	КолДней     = 0;
	ТекДата     = НачалоДня(ДатаНач);
	ДатаКонДень = НачалоДня(ДатаКон);
	
	Пока ТекДата <= ДатаКонДень Цикл
		
		НДН = ДеньНедели(ТекДата);
		Если НДН < 6 Тогда
			КолДней = КолДней + 1;
		КонецЕсли;
		
		ТекДата = ТекДата + 86400;
		
	КонецЦикла;
	
	Возврат КолДней;
	
КонецФункции

#КонецОбласти

#КонецЕсли
